Revit 2027 API
OBJExportOptions(ExportResolution) Constructor
 Constructs a new instance of OBJExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OBJExportOptions(
	ExportResolution resolutionType
)
Public Sub New (
	resolutionType As ExportResolution
)
public:
OBJExportOptions(
	ExportResolution resolutionType
)
new :
        resolutionType : ExportResolution -> OBJExportOptions
Parameters
resolutionType ExportResolution
 The type of export resolution.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OBJExportOptions Class
OBJExportOptions Overload
Autodesk.Revit.DB Namespace